package com.film.cat;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import com.film.cat.model.SimpleItem;

import java.util.ArrayList;

public class GuessActivity extends AppCompatActivity {

    private RecyclerView mRecyclerView;
    private ArrayList<SimpleItem> mDataItem;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_guess);

        data();

        mRecyclerView = (RecyclerView) findViewById(R.id.recyclerView);
        mRecyclerView.setLayoutManager(new LinearLayoutManager(getBaseContext()));
        mRecyclerView.setAdapter(new CustomAdapter());
    }

    private void data() {
        mDataItem = new ArrayList<SimpleItem>();
        mDataItem.add(new SimpleItem("ทำไมน้องแมวถึงมีนิสัยแบบนั้น",
                "\n ตั้งแต่เลี้ยงแมวมา เคยสงสัยไหมคะว่าทำไมน้องเหมียวชอบมีนิสัยที่คาดเดาไม่ค่อยได้? ไม่ว่าจะชอบตะปบสิ่งที่เคลื่อนไหว ชอบมานอนบนรองเท้าของคุณ ชอบขโมยของ หรือแม้แต่ชอบมากวนตอนคุณเล่นคอมพิวเตอร์! มีเบื้องลึกเบื้องหลังอะไรซ่อนอยู่ในพฤติกรรมเหล่านี้บ้างหรือเปล่า เรามีคำตอบมาไขทุกข้อข้องใจให้ได้รู้กันค่ะ\n" +
                        "\n"));

        mDataItem.add(new SimpleItem("ทำไมน้องแมวถึงชอบกระโดดมาทับตอนเรานอน",
                "\n เชื่อว่านี่เป็นเรื่องที่คนเลี้ยงแมวทุกคนต้องเคยเจอค่ะ นอนอยู่บนเตียงอยู่ๆ น้องเหมียวก็กระโดดใส่จนสะดุ้งตื่น แถมยังไม่ยอมไปไหน นอนหลับตาพริ้มบนตัวเรานั่นแหละ ถ้าแมวที่บ้านคุณกำลังทำแบบนี้ทราบไว้เลยนะคะว่าเค้ากำลังบอกความต้องการกับคุณอยู่ ไม่ว่าจะเป็นอาหารแมว น้ำ หรือแม้กระทั่งความสนใจ\n" +
                        "\n ถึงจะชอบเวลาถูกอ้อน แต่คงดีกว่าถ้าเราสามารถฝึกเค้าได้สักหน่อย ไม่ดีเท่าไรถ้าเค้าอ้อนทั้งคืนจนเราแทบไม่ได้นอน ใครที่มีปัญหาถูกน้องแมวกวนจนนอนไม่หลับ ทางเรามีคำแนะนำดีๆ มาฝากค่ะ\n" +
                        "\n 1.\tแยกห้องนอนกับน้องแมว – โดยปกติแล้วแมวเป็นสัตว์ที่หวงอาณาเขตของตัวเองมากค่ะ ดังนั้นการที่เราเตรียมพื้นที่ให้กลายเป็นที่นอนของเค้าโดยสมบูรณ์แบบ จะทำให้เค้าไม่เข้ามากวนเราเวลานอน และยังทำให้น้องแมวรู้ไปเลยว่าห้องคุณเป็นห้องปลอดแมว โดยเพื่อนๆ อาจจะซื้อคอนโดแมว หรือที่นอนแมวไว้ให้เค้าก็ได้ค่ะ\n" +
                        "\n 2.\tเบี่ยงเบนความสนใจ เตรียมของสิ่งอื่นที่จะช่วยให้เจ้าเหมียวรู้สึกสงบลง เช่น ผ้าห่มนุ่มๆ หรือ ของเล่นที่สร้างเสียงคล้ายๆ  เสียงหัวใจเต้นเป็นต้น\n" +
                        "\n"));

        mDataItem.add(new SimpleItem("รู้มั้ย...ทำไมน้องแมวชอบลงไปนอนในกล่อง",
                "\n เห็นน้องเหมียวหน้าตาน่ารักแบบนี้ แต่จริงๆ แล้วน้องแมวจัดเป็นนักล่าโดยธรรมชาตินะคะ ดังนั้นไม่ต้องแปลกใจไปหากจะเห็นเค้าลงไปซ่อนตัวอยู่ในกล่อง เพราะน้องเหมียวจะใช้กล่องเป็นที่ซ่อนเพื่อซุ่มดูเป้าหมายโดยที่ไม่มีใครเห็น ดังนั้นเราจึงสามารถสร้างสภาพแวดล้อมที่ทำให้เค้ารู้สึกผ่อนคลายได้โดยวางกล่อง 2-3 ใบไว้ตามบริเวณต่างๆ ภายในบ้าน หรือไม่ก็ลองใส่ของเล่นลงไปในกล่องสักใบวิธีการนี้จะช่วยให้น้องแมวคลายเครียดได้ด้วยค่ะ\n" +
                        "\n"));

        mDataItem.add(new SimpleItem("รู้มั้ย...ทำไมน้องแมวชอบมานั่งบนคอมพิวเตอร์และโทรทัศน์",
                "\n อีกหนึ่งข้อสงสัยของคนเลี้ยงแมว ทำไมเจ้าเหมียวถึงชอบไปนอนบนโทรทัศน์นัก นั่นเป็นเพราะอุปกรณ์เหล่านี้มักจะอุ่นสบาย แถมภาพเคลื่อนไหวในจอก็ยังกระตุ้นความสนใจของน้องแมวทั้งหลายได้เป็นอย่างดีอีกด้วย แต่เหตุผลที่สำคัญที่สุดก็คือ น้องเหมียวกำลังพยายามดึงความสนใจให้ออกมาจากจอแล้วมาสนใจพวกเค้าแทนนั่นเองค่ะ รู้แบบนี้แล้วก็เล่นกับเค้าซักหน่อยน้า\n" +
                        "\n"));

        mDataItem.add(new SimpleItem("รู้มั้ย...ทำไมน้องแมวชอบกระโดดขึ้นที่สูง",
                "\n พฤติกรรมนี้ก็เกิดจากสัญชาตญาณการเอาตัวรอดของเจ้าเหมียวทั้งหลายเช่นเดียวกันค่ะ เพราะโดยนิสัยแมวแล้วเค้าจะคิดว่ายิ่งสูง ยิ่งปลอดภัย เพราะถ้ามีอะไรอันตรายเกิดขึ้นเค้าก็จะได้ไหวตัวได้ทันนั่นเอง\n" +
                        "\nซึ่งสถานที่สูงๆ ภายในบ้านก็คงหนีไม่พ้นตู้หรือเฟอร์นิเจอร์แสนรักของทุกคนนั่นเอง ดังนั้น เพื่อปกป้องพื้นผิวของเฟอร์นิเจอร์หรือสิ่งของจากรอยเล็บคมๆ นั่น  ขอแนะนำให้หาสถานที่อื่นให้เจ้าเหมียวกระโดดขึ้นไปแทนได้ เช่น ‘คอนโดแมว’ หรือ ‘ต้นไม้แมว’ เป็นต้น อย่าลืมวางคอนโดแมวเหล่านี้ในตำแหน่งที่ทำให้น้องแมวสามารถมองเห็นได้ทั้งห้อง และสามารถกระโดดขึ้นลงได้ง่ายๆ ด้วยนะคะ\n" +
                        "\n"));

        mDataItem.add(new SimpleItem("รู้มั้ย…ทำไมน้องแมวชอบคาบซากสัตว์มาฝากเราเสมอๆ",
                "\n ถ้าวันไหนน้องแมวของเราอยู่ดีๆ ก็คาบสัตว์ตัวเล็กๆ อย่าง หนู จิ้งจก ฯลฯ ที่เค้าล่าได้มามอบให้เรา ไม่ได้หมายความว่าน้องแมวกำลังจะแกล้งให้เราตกใจกลัวเล่นนะคะ แต่เป็นเพราะน้องแมวเป็นสัตว์ที่มีสัญชาติญาณนักล่ามาตั้งแต่กำเนิด จึงถือว่าไม่ใช่เรื่องแปลกที่เค้าจะชอบไล่ล่าสัตว์ตัวเล็กที่มีการเคลื่อนไหวอย่างรวดเร็ว นอกจากนั้นน้องแมวส่วนใหญ่โดยเฉพาะน้องแมวตัวเมีย ก็มักจะมีนิสัยคาบเหยื่อที่ตัวเองล่าได้มาให้ลูกๆ ได้ฝึกการล่าและกินอาหารอยู่เสมอ ซึ่งถ้าน้องแมวเลือกเอาเหยื่อที่ล่ามาให้เรา นั่นก็หมายความว่าเค้ามองเห็นเราเป็นหนึ่งในสมาชิกครอบครัวนั่นเองค่ะ\n" +
                        "\n"));

        mDataItem.add(new SimpleItem("รู้มั้ย…ทำไมน้องแมวขยันเอาหัวมาชน เอาแก้มมาถูไถเราได้ทุกวัน",
                "\n หนึ่งในพฤติกรรมที่แสนน่ารักน่าเอ็นดูของน้องแมว นั่นก็คือการที่เค้ามักจะเอาเอาหัวมาชนหรือเอาแก้มมาถูไถตัวเราบ่อยๆ นั่นเองค่ะ โดยการที่น้องแมวทำแบบนี้ก็เป็นเพราะว่าช่วงบริเวณใบหน้าของเค้าจะมีต่อมกลิ่นพิเศษที่จะปล่อยฟีโรโมนออกมา ซึ่งกลิ่นนี้แหละค่ะจะช่วยเปลี่ยนกลิ่นให้แมวตัวอื่นหรือเจ้าของให้อยู่ภายในสิ่งแวดล้อมเดียวกัน แปลได้ง่ายๆ ว่าพฤติกรรมของน้องแมวแบบนี้ ก็คือหนึ่งในวิธีการแสดงความรักและความคุ้นเคยที่น้องแมวจะสื่อให้รู้ว่า เราเป็นพวกเดียวกันกับเค้าแล้วยังไงล่ะคะทุกคน\n" +
                        "\n"));

        mDataItem.add(new SimpleItem("รู้มั้ย...ทำไมน้องแมวชอบสะกิดเราบ่อย",
                "\n จริงๆ แล้วแมวแต่ละตัวต้องการความสนใจไม่เท่ากันค่ะ ขึ้นอยู่กับบุคลิกของเค้าเอง แมวบางตัวที่เอาขามาสะกิดเรา เพราะเค้าแค่ต้องการให้ลูบเบาๆ ก็เพียงพอแล้ว แต่บางตัวนั้นต้องการมากกว่านั้น ไม่ว่าจะเป็นการขอให้เล่นด้วย หรือแม้แต่ขนมเล็กๆ น้อยๆ ก็ตาม\n" +
                        "\n เพื่อนๆ ควรจะเริ่มต้นด้วยการแสดงความรักแบบเบาๆ ก่อนเพื่อเป็นการไม่สปอยล์เค้าจนเกินไป เพราะโดยนิสัยแมวทั่วไปแล้ว น้องเหมียวเค้าจำได้นะเวลาที่เค้าทำอะไร แล้วเราตอบสนองกับพฤติกรรมนั้นอย่างไร เช่น ถ้าเค้าสะกิดตัวเราแล้วร้องเหมียว แล้วเราแกะถุงขนมให้เค้ากิน น้องแมวก็จะจำไว้ว่าถ้าครั้งหน้าอยากได้ขนมก็ต้องทำแบบนี้ ซึ่งถ้าต่อไปเราไม่ให้เค้าก็จะกวนเราไปเรื่อยๆ จนกว่าจะได้ในสิ่งที่เค้าต้องการนั่นแหละค่ะ\n" +
                        "\n"));
    }

    private class CustomAdapter extends RecyclerView.Adapter<CustomHolder> {
        @NonNull
        @Override
        public CustomHolder onCreateViewHolder(@NonNull ViewGroup parent, int viewType) {
            View view = LayoutInflater.from(parent.getContext()).inflate(android.R.layout.simple_list_item_2, parent, false);
            return new CustomHolder(view);
        }

        @Override
        public void onBindViewHolder(@NonNull CustomHolder holder, int position) {
            holder.tvText1.setText(mDataItem.get(position).getText1());
            holder.tvText2.setText(mDataItem.get(position).getText2());
        }

        @Override
        public int getItemCount() {
            return mDataItem.size();
        }
    }

    private class CustomHolder extends RecyclerView.ViewHolder {
        private final TextView tvText1;
        private final TextView tvText2;

        public CustomHolder(@NonNull View itemView) {
            super(itemView);

            tvText1 = (TextView) itemView.findViewById(android.R.id.text1);
            tvText2 = (TextView) itemView.findViewById(android.R.id.text2);
        }
    }
}
