package com.film.cat;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;

import com.film.cat.model.SimpleItem;

import java.util.ArrayList;

public class PurinaOneActivity extends AppCompatActivity {

    private RecyclerView mRecyclerView;
    private ArrayList<SimpleItem> mDataItem;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_purina_one);

        data();

        mRecyclerView = (RecyclerView) findViewById(R.id.recyclerView);
        mRecyclerView.setLayoutManager(new LinearLayoutManager(getBaseContext()));
        mRecyclerView.setAdapter(new CustomAdapter());
    }

    private void data() {
        mDataItem = new ArrayList<SimpleItem>();
        mDataItem.add(new SimpleItem("ควรให้น้องเหมียวกินอาหารแมวแบบแห้งหรือแบบเปียกดีนะ?",
                "\n หนึ่งในปัญหาโลกแตกของคนเลี้ยงแมว คือ ไม่รู้ว่าควรจะให้เค้ากินอาหารแมวแบบไหนดี ในเมื่ออาหารแมวมีให้เลือกตั้งหลายชนิด แล้วอาหารแมวแบบไหนเหมาะกับเจ้าเหมียวของเรามากที่สุดกันล่ะ วันนี้เราเลยจะมาแบ่งปันความรู้เรื่องอาหารแมวแต่ละประเภทกันค่ะ\n" +
                "\n"));

        mDataItem.add(new SimpleItem("อาหารแมวแบบแห้ง",
                "\n อาหารแมวแบบแห้งนั้นมีประโยชน์ต่อสุขภาพฟัน เพราะการเคี้ยวจะช่วยทำความสะอาดฟันได้ดี อีกทั้งยังลดการเกิดของคราบพลัคและหินปูนในแมว ช่วยให้เค้ามีฟันที่แข็งแรง ที่สำคัญคือการเคี้ยวอาหารแมวแบบแห้งนั้นมีลักษณะคล้ายกับการเคี้ยวเหยื่อ ซึ่งสามารถตอบสนองพฤติกรรมนักล่าของเจ้าเหมียวได้เป็นอย่างดีค่ะ\n" +
                "\n"));

        mDataItem.add(new SimpleItem("อาหารแมวแบบเปียก",
                "\n อาหารแมวแบบเปียกประกอบด้วยปริมาณน้ำสูงกว่าแบบแห้งหรือแบบเม็ด ช่วยให้น้องแมวได้รับน้ำเข้าร่างกายไปด้วยในตัว โดยเฉพาะอย่างยิ่ง ถ้านิสัยน้องแมวของเรานั้นไม่ชอบดื่มน้ำมากนัก อาหารแมวแบบเปียกก็จะช่วยได้ในจุดนี้นั่นเอง แต่ข้อเสียก็คืออาหารแมวแบบเปียกมีราคาค่อนข้างแพง และถ้าน้องแมวทานเหลือเราต้องรีบเก็บทันที เพราะถ้ากลิ่นอาหารจางลง น้องแมวก็จะไม่ยอมกินซ้ำอีก\n" +
                "\n"));

        mDataItem.add(new SimpleItem("วิธีการให้อาหารน้องแมวทั้งแบบแห้งและแบบเปียก",
                "\n สำหรับเทคนิคการให้อาหารแมวแบบแห้งหรือแบบเม็ดนั้น สิ่งแรกที่ควรใส่ใจก็คือการกำหนดปริมาณอาหารให้น้องแมวทานนั่นเอง เพราะน้องแมวในแต่ละช่วงวัยต่างก็ต้องการอาหารไม่เท่ากัน โดยเบื้องต้นนั้นทุกคนสามารถศึกษาปริมาณการให้อาหารที่พอเหมาะได้จากข้อมูลที่ระบุอยู่ในข้างถุงของ Purina ONE ทุกสูตร และเราควรฝึกเจ้าเหมียวให้กินอาหารให้เป็นเวลา เช่น ช่วงเช้าและช่วงเย็น เพื่อจะได้ควบคุมปริมาณการกินได้อย่างเหมาะสมค่ะ\n" +
                        "\n ส่วนอาหารแมวแบบเปียกนั้น มีข้อดีในเรื่องของรสชาติและความหลากหลาย ซึ่งจะช่วยกระตุ้นให้น้องแมวเพิ่มความอยากอาหารจากมื้อปกติขึ้นได้มากค่ะ เพื่อนๆ อาจจะใช้เทคนิคการให้อาหารเม็ดแบบแห้งเป็นหลัก จากนั้นให้โรยอาหารแมวแบบเปียกลงไปข้างบนเล็กน้อยเพื่อเสริมรสชาติ หรือสลับบางมื้ออาหารจากอาหารเม็ดมาให้อาหารเปียกแทน เนื่องจากอาหารเเบบเปียกมีปริมาณของน้ำเยอะกว่าอาหารเม็ดค่อนข้างมาก จึงช่วยให้น้องแมวของเราได้เติมน้ำให้แก่ร่างกายสำหรับแมวที่ดื่มน้ำน้อยได้อีกด้วย\n" +
                        "\n ไม่ว่าจะเป็นอาหารแมวแบบแห้งหรือแบบเปียก สิ่งสำคัญที่ทุกคนควรใส่ใจก็คือการให้น้องแมวของเราได้ทานอาหารที่มีคุณค่าสารอาหารครบถ้วน และอย่าลืมดูปริมาณให้เหมาะสมเพื่อไม่ให้น้องแมวได้รับอาหารที่มากเกินกว่าที่เค้าต้องการด้วยนะคะ\n" +
                        "\n"));

        mDataItem.add(new SimpleItem("ทำไมถึงควรให้น้องแมวทานอาหารเม็ดแบบแห้งเป็นหลัก",
                "\n นอกจากข้อดีของอาหารแมวแบบแห้งหรือแบบเม็ดนั่นคือราคาไม่แพงจนเกินไปแล้ว ถ้าเพื่อนๆ ลองสังเกตวิธีการทานอาหารของน้องแมวเป็นประจำ จะเห็นได้ว่าน้องแมวส่วนใหญ่มักมีนิสัย กินน้อยแต่กินบ่อย ดังนั้นการเลือกอาหารเม็ดแบบแห้งให้น้องแมวได้ทานจึงเป็นข้อได้เปรียบค่ะ เพราะตัวอาหารแมวแบบแห้งนั้นจะคงสภาพและรสชาติอยู่ได้นาน เพื่อนๆ สามารถใส่ชามไว้ให้เค้าทานได้นานกว่า ทั้งยังไม่เลอะเทอะ ไม่มีกลิ่น นอกจากนั้นอาหารเม็ดยังสามารถหาซื้อได้ง่าย รวมถึงเก็บเอาไว้ได้นาน ทั้งยังใช้กับเครื่องให้อาหารอัตโนมัติที่ช่วยให้เจ้าของดูแลน้องแมวได้สะดวกขึ้นอีกด้วย\n" +
                        "\n"));

        mDataItem.add(new SimpleItem("แล้วอาหารแห้งแบบไหนเหมาะกับน้องแมวกันล่ะ?",
                "\n เพราะว่าแมวแต่ละวัยนั้นมีความต้องการอาหารแมวไม่เหมือนกัน มาดูกันดีกว่าว่าเจ้าเหมียวของเราเหมาะกับอาหารแมวของ Purina ONE สูตรไหน!\n" +
                        "\n Healthy Kitten Formula: สูตรลูกแมว (อายุ 3 สัปดาห์ - 1 ปี) เหมาะสำหรับลูกแมวทุกสายพันธุ์ที่กำลังเจริญเติบโต เพราะว่ามี DHA ซึ่งเป็นสารอาหารสำคัญในน้ำนมของแม่แมว เพื่อพัฒนาการทางสมองและตา อีกทั้งยังมีโปรตีนสูงถึง 40% ทำมาจากเนื้อไก่และข้าว ย่อยง่าย เหมาะสำหลับลูกแมว\n" +
                        "\n Indoor Advantage: สูตรสำหรับแมวเลี้ยงในบ้านทุกสายพันธุ์ เหมาะกับแมวโตที่ไม่ค่อยมีกิจกรรมโลดโผนมากนัก ทำจากเนื้อไก่งวง ให้โปรตีนสูง แต่มีแคลอรี่ต่ำ ช่วยควบคุมน้ำหนักสำหรับแมวที่มีกิจกรรมน้อย มีใยอาหารจากธรรมชาติสูง ช่วยในการขับถ่าย และผลักก้อนขนที่อาจอุดตันอยู่ในลำใส้ออกจากร่างกาย คนที่เลี้ยงน้องแมวขนยาว เช่นพันธุ์เปอร์เซีย หรือ อเมริกันช็อตแฮร์ สก็อตทิชโฟลด์ ฯลฯ อยู่ นี่คืออาหารแมวที่จะลดปัญหาก้อนขนไปได้เยอะเลย\n" +
                        "\n Salmon & Tuna Formula: สูตรปลาแซลมอนและปลาทูน่า สูตรนี้ก็เหมาะสำหรับแมวโตเช่นกันค่ะ ทำจากเนื้อปลาแซลมอนและทูน่า จึงมีโอเมก้า 3  และ 6 สูง ให้น้องแมวขนสวยงาม ผิวหนังสุขภาพดี ดวงตาสดใส ที่สำคัญยังมีสารต้านอนุมูลอิสระจากวิตามิน A, E และซีลีเนียมที่ช่วยสร้างภูมิต้านทาน ให้เค้ามีสุขภาพดีครบ 6 ประการอีกด้วยค่ะ\n" +
                        "\n ทั้งนี้ ไม่ว่าน้องแมวของเพื่อนๆ จะชอบทานอาหารแบบแห้งหรือแบบเปียกเป็นหลัก ขอเพียงเราทุกคนคอยดูแลใส่ใจ และเลือกอาหารแมวที่ทุกคนมั่นใจได้ว่าผลิตจากวัตถุดิบคุณภาพสูง เพื่อเสริมสร้างสัญญาณสุขภาพดีให้กับน้องแมวได้อย่างเหมาะสม เท่านี้น้องแมวก็จะมีความสุขและพร้อมจะสร้างความเบิกบานใจให้เราได้ในทุกๆ วันแล้วล่ะค่ะ"));
    }


    private class CustomAdapter extends RecyclerView.Adapter<CustomHolder> {
        @NonNull
        @Override
        public CustomHolder onCreateViewHolder(@NonNull ViewGroup parent, int viewType) {
            View view = LayoutInflater.from(parent.getContext()).inflate(android.R.layout.simple_list_item_2, parent, false);
            return new CustomHolder(view);
        }

        @Override
        public void onBindViewHolder(@NonNull CustomHolder holder, int position) {
            holder.tvText1.setText(mDataItem.get(position).getText1());
            holder.tvText2.setText(mDataItem.get(position).getText2());
        }

        @Override
        public int getItemCount() {
            return mDataItem.size();
        }
    }

    private class CustomHolder extends RecyclerView.ViewHolder {
        private final TextView tvText1;
        private final TextView tvText2;

        public CustomHolder(@NonNull View itemView) {
            super(itemView);

            tvText1 = (TextView) itemView.findViewById(android.R.id.text1);
            tvText2 = (TextView) itemView.findViewById(android.R.id.text2);
        }
    }
}
